---
title: StructuralSectionRound
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# StructuralSectionRound

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double CentroidHorizontal { get; set; }` | `structuralSectionRound.CentroidHorizontal` | Double |
| `Double CentroidVertical { get; set; }` | `structuralSectionRound.CentroidVertical` | Double |
| `Double Diameter { get; set; }` | `structuralSectionRound.Diameter` | Double |
| `String NameKey { get; set; }` | `structuralSectionRound.NameKey` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```